import pandas as pd
import pytest


@pytest.fixture
def read_data_frame():
    return pd.DataFrame(
        {
            "Дата операции": ["31.12.2021 16:44:00"],
            "Дата платежа": ["31.12.2021"],
            "Номер карты": ["*7197"],
            "Статус": ["OK"],
            "Сумма операции": [-160.89],
            "Валюта операции": ["RUB"],
            "Сумма платежа": [-160.89],
            "Валюта платежа": ["RUB"],
            "Кэшбэк": [""],
            "Категория": ["Супермаркеты"],
            "MCC": ["5411"],
            "Описание": ["Колхоз"],
            "Бонусы (включая кэшбэк)": [""],
            "Округление на инвесткопилку": [0.00],
            "Сумма операции с округлением": [160.89],
        }
    )
