import os

import pandas as pd

from src.reports import spending_by_category


def test_spending_by_category():
    ex = pd.DataFrame(
        {
            "Дата операции": ["2018-01-01 00:00:00"],
            "Дата платежа": ["01.01.2018"],
            "Номер карты": ["*7197"],
            "Статус": ["OK"],
            "Сумма операции": [-160.89],
            "Валюта операции": ["RUB"],
            "Сумма платежа": [-160.89],
            "Валюта платежа": ["RUB"],
            "Кэшбэк": [""],
            "Категория": ["Супермаркеты"],
            "MCC": ["5411"],
            "Описание": ["Колхоз"],
            "Бонусы (включая кэшбэк)": [""],
            "Округление на инвесткопилку": [0.00],
            "Сумма операции с округлением": [160.89],
        }
    )
    spending_by_category(ex, "Супермаркеты", "2018-01-10 00:00:00")
    expected = (
        '[{"Дата операции":"2018-01-01T00:00:00.000","Дата '
        'платежа":"01.01.2018","Номер карты":"*7197","Статус":"OK","Сумма '
        'операции":-160.89,"Валюта операции":"RUB","Сумма платежа":-160.89,"Валюта '
        'платежа":"RUB","Кэшбэк":"","Категория":"Супермаркеты","MCC":"5411","Описание":"Колхоз","Бонусы '
        '(включая кэшбэк)":"","Округление на инвесткопилку":0.0,"Сумма операции с '
        'округлением":160.89}]'
    )
    file_dir = os.path.join(os.path.dirname(__file__), "../data", "report.json")
    with open(file_dir, "r") as file:
        assert file.read() == expected
