from unittest.mock import patch

import pandas as pd
from pandas import Timestamp

from src.utils import date_filter


def test_date_filter() -> None:
    """Тест функции date_filter."""

    read_data = pd.DataFrame({
        "Дата операции": ["31.12.2021 16:44:00"],
        "Дата платежа": ["31.12.2021"],
        "Номер карты": ["*7197"],
        "Статус": ["OK"],
        "Сумма операции": [-160.89],
        "Валюта операции": ["RUB"],
        "Сумма платежа": [-160.89],
        "Валюта платежа": ["RUB"],
        "Кэшбэк": [""],
        "Категория": ["Супермаркеты"],
        "MCC": ["5411"],
        "Описание": ["Колхоз"],
        "Бонусы (включая кэшбэк)": [""],
        "Округление на инвесткопилку": [0.00],
        "Сумма операции с округлением": [160.89],
    }
    )

    expected_result = [{'MCC': '5411',
                        'Бонусы (включая кэшбэк)': '',
                        'Валюта операции': 'RUB',
                        'Валюта платежа': 'RUB',
                        'Дата операции': Timestamp('2021-12-31 16:44:00'),
                        'Дата платежа': '31.12.2021',
                        'Категория': 'Супермаркеты',
                        'Кэшбэк': '',
                        'Номер карты': '*7197',
                        'Округление на инвесткопилку': 0.0,
                        'Описание': 'Колхоз',
                        'Статус': 'OK',
                        'Сумма операции': -160.89,
                        'Сумма операции с округлением': 160.89,
                        'Сумма платежа': -160.89}]
    result = date_filter("2021-12-31 23:59:59", read_data)
    res = result.to_dict(orient="records")
    assert res == expected_result
