import pandas as pd

from src.utils import date_filter

df = pd.DataFrame({
            "Дата операции": ["31.12.2021 16:44:00"],
            "Дата платежа": ["31.12.2021"],
            "Номер карты": ["*7197"],
            "Статус": ["OK"],
            "Сумма операции": [-160.89],
            "Валюта операции": ["RUB"],
            "Сумма платежа": [-160.89],
            "Валюта платежа": ["RUB"],
            "Кэшбэк": [""],
            "Категория": ["Супермаркеты"],
            "MCC": ["5411"],
            "Описание": ["Колхоз"],
            "Бонусы (включая кэшбэк)": [""],
            "Округление на инвесткопилку": [0.00],
            "Сумма операции с округлением": [160.89],
        }
    )
print(df)
result = date_filter("2021-12-31 23:59:59", df)
print(result)